lib/hauts_de_seine/templates/bookRequest.xml.hbs

<?xml version="1.0" encoding="UTF-8"?>
<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
   <s:Header>
      <SdkClientVersion xmlns="http://schemas.microsoft.com/xrm/2011/Contracts">9.0</SdkClientVersion>
   </s:Header>
   <s:Body>
      <Execute xmlns="http://schemas.microsoft.com/xrm/2011/Contracts/Services" xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
         <request xmlns:a="http://schemas.microsoft.com/xrm/2011/Contracts" xmlns:b="http://schemas.microsoft.com/crm/2011/Contracts" i:type="b:BookRequest">
            <a:Parameters xmlns:b="http://schemas.datacontract.org/2004/07/System.Collections.Generic">
               <a:KeyValuePairOfstringanyType>
                  <b:key>Target</b:key>
                  <b:value i:type="a:Entity">
                     <a:Attributes>
                        <a:KeyValuePairOfstringanyType>
                           <b:key>scheduledstart</b:key>
                           <b:value xmlns:c="http://www.w3.org/2001/XMLSchema" i:type="c:dateTime">{{scheduledstart}}</b:value>
                        </a:KeyValuePairOfstringanyType>
                        <a:KeyValuePairOfstringanyType>
                           <b:key>cap_demandeur</b:key>
                           <b:value i:type="a:EntityReference">
                              <a:Id>{{cap_demandeur}}</a:Id>
                              <a:LogicalName>contact</a:LogicalName>
                           </b:value>
                        </a:KeyValuePairOfstringanyType>
                        <a:KeyValuePairOfstringanyType>
                           <b:key>cap_professionnel</b:key>
                           <b:value i:type="a:EntityReference">
                              <a:Id>{{cap_professionnel}}</a:Id>
                              <a:LogicalName>systemuser</a:LogicalName>
                           </b:value>
                        </a:KeyValuePairOfstringanyType>
                        <a:KeyValuePairOfstringanyType>
                           <b:key>scheduledend</b:key>
                           <b:value xmlns:c="http://www.w3.org/2001/XMLSchema" i:type="c:dateTime">{{scheduledend}}</b:value>
                        </a:KeyValuePairOfstringanyType>
                        <a:KeyValuePairOfstringanyType>
                           <b:key>statuscode</b:key>
                           <b:value i:type="a:OptionSetValue">
                              <a:Value>5</a:Value>
                           </b:value>
                        </a:KeyValuePairOfstringanyType>
                        <a:KeyValuePairOfstringanyType>
                           <b:key>organizer</b:key>
                           <b:value i:type="a:EntityCollection">
                              <a:Entities>
                                 <a:Entity>
                                    <a:Attributes>
                                       <a:KeyValuePairOfstringanyType>
                                          <b:key>partyid</b:key>
                                          <b:value i:type="a:EntityReference">
                                             <a:Id>{{cap_professionnel}}</a:Id>
                                             <a:LogicalName>systemuser</a:LogicalName>
                                          </b:value>
                                       </a:KeyValuePairOfstringanyType>
                                    </a:Attributes>
                                    <a:EntityState i:nil="true" />
                                    <a:FormattedValues />
                                    <a:LogicalName>activityparty</a:LogicalName>
                                    <a:RelatedEntities />
                                 </a:Entity>
                              </a:Entities>
                           </b:value>
                        </a:KeyValuePairOfstringanyType>
                        <a:KeyValuePairOfstringanyType>
                           <b:key>cap_beneficiaire</b:key>
                           <b:value i:type="a:EntityReference">
                              <a:Id>{{cap_beneficiaire}}</a:Id>
                              <a:LogicalName>contact</a:LogicalName>
                           </b:value>
                        </a:KeyValuePairOfstringanyType>
                        <a:KeyValuePairOfstringanyType>
                           <b:key>requiredattendees</b:key>
                           <b:value i:type="a:EntityCollection">
                              <a:Entities>
                                 <a:Entity>
                                    <a:Attributes>
                                       <a:KeyValuePairOfstringanyType>
                                          <b:key>partyid</b:key>
                                          <b:value i:type="a:EntityReference">
                                             <a:Id>{{cap_professionnel}}</a:Id>
                                             <a:LogicalName>systemuser</a:LogicalName>
                                          </b:value>
                                       </a:KeyValuePairOfstringanyType>
                                    </a:Attributes>
                                    <a:EntityState i:nil="true" />
                                    <a:FormattedValues />
                                    <a:LogicalName>activityparty</a:LogicalName>
                                    <a:RelatedEntities />
                                 </a:Entity>
                              </a:Entities>
                           </b:value>
                        </a:KeyValuePairOfstringanyType>
                     </a:Attributes>
                     <a:EntityState i:nil="true" />
                     <a:FormattedValues />
                     <a:LogicalName>appointment</a:LogicalName>
                     <a:RelatedEntities />
                  </b:value>
               </a:KeyValuePairOfstringanyType>
               <a:KeyValuePairOfstringanyType>
                  <b:key>MaintainLegacyAppServerBehavior</b:key>
                  <b:value xmlns:c="http://www.w3.org/2001/XMLSchema" i:type="c:boolean">true</b:value>
               </a:KeyValuePairOfstringanyType>
               <a:KeyValuePairOfstringanyType>
                  <b:key>ReturnNotifications</b:key>
                  <b:value xmlns:c="http://www.w3.org/2001/XMLSchema" i:type="c:boolean">true</b:value>
               </a:KeyValuePairOfstringanyType>
            </a:Parameters>
            <a:RequestId i:nil="true" />
            <a:RequestName>Book</a:RequestName>
         </request>
      </Execute>
   </s:Body>
</s:Envelope>
